Additional details: This issue appears specific to the **managed_rule_group_statement** blocks for Terraform `v1.10.3` and provider registry.terraform.io/hashicorp/aws `v5.82.2`.  

### Initial deployment
```shell
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_wafv2_ip_set.fixture[0] will be created
  + resource "aws_wafv2_ip_set" "fixture" {
      + addresses          = [
          + "1.2.3.4/32",
          + "5.6.7.8/32",
        ]
      + arn                = (known after apply)
      + description        = "Example IP set"
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "terratest-kpn"
      + scope              = "REGIONAL"
      + tags               = {
          + "name" = "terratest-kpn"
        }
    }

  # aws_wafv2_regex_pattern_set.fixture[0] will be created
  + resource "aws_wafv2_regex_pattern_set" "fixture" {
      + arn         = (known after apply)
      + description = "Example regex pattern set"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "terratest-kpn"
      + scope       = "REGIONAL"
      + tags        = {
          + "name" = "terratest-kpn"
        }
      + regular_expression {
          + regex_string = "one"
        }
      + regular_expression {
          + regex_string = "two"
        }
    }

  # module.waf_regional[0].aws_wafv2_web_acl.default[0] will be created
  + resource "aws_wafv2_web_acl" "default" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "terratest-kpn"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "terratest-kpn"
      + scope                       = (known after apply)
      + tags                        = {
          + "name" = "terratest-kpn"
        }
      + token_domains               = (known after apply)

      + custom_response_body (known after apply)

      + default_action {
          + allow (known after apply)
          + block (known after apply)
        }

      + rule (known after apply)

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "terratest-kpn-main-metrics"
          + sampled_requests_enabled   = false
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
### PLAN after deployment
```shell
aws_wafv2_ip_set.fixture[0]: Refreshing state... [id=4e05f17b-cd3b-4fc1-bb23-01347e7c6ddc]
aws_wafv2_regex_pattern_set.fixture[0]: Refreshing state... [id=ae7b8f45-3003-4f7b-8c91-8d91b685bde4]
module.waf_regional[0].aws_wafv2_web_acl.default[0]: Refreshing state... [id=f8e08bfe-cdc7-4983-b59d-540bf6dd2f6a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.waf_regional[0].aws_wafv2_web_acl.default[0] has changed
  ~ resource "aws_wafv2_web_acl" "default" {
        id                          = "f8e08bfe-cdc7-4983-b59d-540bf6dd2f6a"
        name                        = "terratest-kpn"
        tags                        = {
            "name" = "terratest-kpn"
        }
        # (8 unchanged attributes hidden)

      - rule {
          - name     = "AWSManagedRulesBotControlRuleSet" -> null
          - priority = 10 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesBotControlRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)

                  - managed_rule_group_configs {
                        # (2 unchanged attributes hidden)

                      - aws_managed_rules_bot_control_rule_set {
                          - enable_machine_learning = true -> null
                          - inspection_level        = "COMMON" -> null
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesBotControlRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesBotControlRuleSet"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesBotControlRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)

                  + managed_rule_group_configs {
                        # (2 unchanged attributes hidden)

                      + aws_managed_rules_bot_control_rule_set {
                          + enable_machine_learning = false
                          + inspection_level        = "COMMON"
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesBotControlRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.waf_regional[0].aws_wafv2_web_acl.default[0] will be updated in-place
  ~ resource "aws_wafv2_web_acl" "default" {
        id                          = "f8e08bfe-cdc7-4983-b59d-540bf6dd2f6a"
        name                        = "terratest-kpn"
        tags                        = {
            "name" = "terratest-kpn"
        }
        # (9 unchanged attributes hidden)

      - rule {
          - name     = "AWSManagedRulesBotControlRuleSet" -> null
          - priority = 10 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesBotControlRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)

                  - managed_rule_group_configs {
                        # (2 unchanged attributes hidden)

                      - aws_managed_rules_bot_control_rule_set {
                          - enable_machine_learning = false -> null
                          - inspection_level        = "COMMON" -> null
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesBotControlRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesCommonRuleSet" -> null
          - priority = 11 -> null

          - override_action {
              - count {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesCommonRuleSet-metric" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 12 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesBotControlRuleSet"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesBotControlRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)

                  + managed_rule_group_configs {
                        # (2 unchanged attributes hidden)

                      + aws_managed_rules_bot_control_rule_set {
                          + enable_machine_learning = true
                          + inspection_level        = "COMMON"
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesBotControlRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 11

          + override_action {
              + count {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet-metric"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 12

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

If there is more than one managed rule, the PLAN always show terraform recreating the managed rules.